In [1]:
import pandas as pd
import numpy as np
import re
import unicodedata
import pickle

In [2]:
pd.set_option('display.max_colwidth', 1000)
pd.set_option('display.max_rows', 400)

In [60]:
data = pd.read_table('text_files/football-city-html.txt')

In [61]:
df = data.rename(columns={"</div>": "data"})

In [62]:
terms = ['col-sm-6 col-xs-6', 'col-sm-3 hidden-xs', '/modules/images/flags/']

In [63]:
df = df[df.data.str.contains('|'.join(terms))]

In [64]:
df.drop(index=5, inplace=True)

In [65]:
df.shape

(5782, 1)

In [66]:
df

                                                                                   data
13                                      <div class="col-sm-6 col-xs-6"><b>AaB</b></div>
18              <img src="/modules/images/flags/_56.png" alt="Denmark" title="Denmark">
20                                        <div class="col-sm-3 hidden-xs">Aalborg</div>
27                                 <div class="col-sm-6 col-xs-6"><b>Aalesund</b></div>
32               <img src="/modules/images/flags/_140.png" alt="Norway" title="Norway">
...                                                                                 ...
27134  <img src="/modules/images/flags/_181.png" alt="Switzerland" title="Switzerland">
27136                                        <div class="col-sm-3 hidden-xs">Bern</div>
27143                       <div class="col-sm-6 col-xs-6"><b>Young Buffaloes</b></div>
27148      <img src="/modules/images/flags/_179.png" alt="Swaziland" title="Swaziland">
27150                                     <div class="col-sm-3 hidden-xs">Manzini</div>

[5782 rows x 1 columns]

In [67]:
pattern = '|'.join(['<div class=\"col-sm-6 col-xs-6\"><b>', '<img src=\"/modules/images/flags/_', '<div class=\"col-sm-3 hidden-xs\">', '</b>', '</div>'])

In [68]:
df.data = df.data.str.replace(pattern, '')

/tmp/ipykernel_22694/2799521911.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df.data = df.data.str.replace(pattern, '')

In [69]:
def removing_patterns(df: pd.DataFrame, col_names: list, patern: str):
    df[col_names].apply(lambda x: str(x) if re.search(pattern, str(x)) is None else re.findall(pattern, str(x)))
    return df

In [70]:
pattern = r'\"[\s|\w]+\">$'
df = removing_patterns(df, list(df), pattern)

In [71]:
def find_no_utf_symbols(sr: pd.Series):
    find_symols = r'[^.a-zA-Z0-9)(&"\s>;<=,-/}{\']'
    rare_symbols = sr.map(lambda x: ''.join(re.findall(find_symols, str(x))))
    return rare_symbols

In [72]:
rare_symbols = find_no_utf_symbols(df.data)

In [73]:
str(set(rare_symbols))

"{'', 'šéá', 'Ō', 'ôô', 'ăă', 'ê', 'čŠ', 'áá', 'ëë', 'Łóź', 'ăţ', 'îş', 'áň', 'ėž', 'æ', 'È', 'ãç', 'áž', 'çğ', 'úí', 'ć', 'šá', 'ëçë', 'áí', 'í', 'éï', 'ġā', 'ı', 'à', 'Í', 'ăăş', 'Ñú', 'āā', 'ăăăş', 'ãí', 'éë', 'ış', 'º', 'óñ', 'öä', 'łł', 'É', 'ěříž', 'øø', 'ī', 'âá', 'àò', 'é', 'íá', 'ľ', 'ľý', 'ýí', 'ń', 'ţ', 'ź', 'éé', 'ä', 'š', 'Śś', 'đ', 'ą', 'Şüə', 'íð', 'ðæ', 'ę', 'łó', 'çã', 'İÖİ', 'čš', 'ážá', 'çş', 'è', 'ří', 'ủầộ', '’éé', 'Šľ', 'àộ', 'č', 'ú', 'ā', 'žň', 'žíš', 'šňé', 'óã', 'ıçğ', 'ýŽáš', 'î', 'əə', 'Şı', 'ū', 'Š', 'šýš', 'ééá', 'óŁę', 'šć', 'áó', 'ľé', 'ó', 'ç', 'Łę', 'ž', 'ď', 'âş', 'ş', 'ľč', 'žá', 'ęó', 'íáé', 'ūẓī', 'ığ', 'şş', 'ğ', 'čí', 'Žž', 'ží', 'ãã', 'çöüü', 'éá', 'õ', 'óú', 'íí', 'ýá', 'óó', 'üü', 'Å', 'ýŽ', 'óę', 'ë', 'äé', 'ʿā', 'ññ', 'ü', 'å', 'ė', 'çë', 'öö', 'ă', 'óá', 'éó', 'áš', 'ø', 'ł', 'ää', 'šáá', 'éšě', 'ô', 'ñ', 'ġāī', 'ș', 'ïé', 'íš', 'ā’', 'Ž', 'ō', 'ň', '’', 'ã', 'ï', 'áŠ', 'əəə', 'āḍ', 'â', 'ööö', 'éḥ', 'ö', 'Čč', 'ýáš', 'İ', 'ř', 'áé', 'öð', 'Ħ', 'á', 'ðø'}"

In [74]:
all_symbols = []
for symbol in rare_symbols:
    symbols = ''.join(symbol)
    all_symbols.append(symbols)
all_symbols = str(all_symbols)
all_symbols = ''.join(set(str(all_symbols)))
all_symbols = all_symbols.replace(' ', '')
all_symbols = all_symbols.replace(']', '')
all_symbols = all_symbols.replace('[', '')
all_symbols = all_symbols.replace(',', '')
all_symbols = all_symbols.replace('\'', '')

In [75]:
all_symbols

'ʿŌầêŁæÈćíıŞàÍºŚÉộīəéľńţźäðšđąęèḍḥčòúāîūŠóçďžşğõýÅëÑġüåėČăøłôñșěŽśōň’ãẓïâöủİÖřĦá'

In [76]:
pattern_2 = r'^[0-9]+.png'
pattern_3 = r'title=\"(.+?)\"'

In [77]:
df = df.data.apply(lambda x: ''.join(re.findall(pattern_3, str(x)) if re.search(pattern_2, str(x)) is not None else x))

In [78]:
df = pd.DataFrame(df)

In [79]:
df.shape

(5782, 1)

In [80]:
df.iloc[648:649,:]

     data
3067

In [81]:
df.data.replace('', np.nan, inplace=True)

In [82]:
df.dropna(subset=['data'], inplace=True)

In [83]:
df.shape

(5757, 1)

In [84]:
def str_decode(str_obj: str):
    normalized = unicodedata.normalize('NFD', str_obj)
    decode_str = u"".join([c for c in normalized if not unicodedata.combining(c)])
    return decode_str

In [85]:
df.data = df.data.apply(lambda x: str_decode(x))

In [86]:
rare_symbols_keys = {'ł':'l','Ł':'L','º':'','ʿ':'\'','ə':'e','Ħ':'H','đ':'d','’':'\'','ı':'i','æ':'a','ð':'d','ø':'o'}

def replace_rare_symbols(df: pd.DataFrame, col_name: str, dict_obj: dict):
    for k, v in rare_symbols_keys.items():
        df[col_name] = df[col_name].apply(lambda x: x.replace(k, v) if re.search(k, str(x)) else x)
    return df[col_name]

In [87]:
df.data = replace_rare_symbols(df, 'data', rare_symbols_keys)

In [88]:
df.head(3)

       data
13      AaB
18  Denmark
20  Aalborg

In [89]:
df.reset_index(inplace=True)

In [90]:
df.drop('index', axis=1, inplace=True)

In [91]:
club, country, city = df[0::3], df[1::3], df[2::3]

In [92]:
table_df = pd.concat([club.reset_index(drop=True), country.reset_index(drop=True), city.reset_index(drop=True)], axis=1)

In [93]:
table_df.columns.values[0] = "team"
table_df.columns.values[1] = "country"
table_df.columns.values[2] = "city"

In [94]:
table_df.shape

(1919, 3)

In [95]:
df = table_df.copy()

In [96]:
# take city.values from hooks for transcription
df.city = df.city.map(lambda x: ''.join(re.findall(r'\((.*?)\)', x)) if re.search(r'\(', x) else x)

In [97]:
# remove Buenos Aires districts
buenos_pattern = 'Buenos'
df.city = df.city.apply(lambda x: x if re.search(buenos_pattern, str(x)) is None else 'Buenos Aires')

In [98]:
# take city.values before '/'
df.city = df.city.map(lambda x: ''.join(re.findall(r'^(.*?)/', x)) if re.search(r'\/', x) else x)

In [99]:
# take city.values before ',' without districts
df.city = df.city.map(lambda x: ''.join(re.findall(r'^(.*?),', x)) if re.search(r',', x) else x)

In [100]:
# rename 'D.F.' at 'Mexico'
mexico_pattern = 'D.F.'
df.city = df.city.apply(lambda x: x if re.search(mexico_pattern, str(x)) is None else 'Mexico')

In [101]:
df['team_id'] = None

In [102]:
df.insert(1, 'team_id', df.pop('teams_ids'))

In [103]:
df.head()

       team teams_ids      country      city
0       AaB      None      Denmark   Aalborg
1  Aalesund      None       Norway   Alesund
2     Aarau      None  Switzerland     Aarau
3       ABC      None       Brazil     Natal
4  Aberdeen      None     Scotland  Aberdeen

In [104]:
df.tail()

                     team teams_ids      country           city
1914             Yokohama      None        Japan       Yokohama
1915  Yokohama F. Marinos      None        Japan       Yokohama
1916       Young Africans      None     Tanzania  Dar-es-Salaam
1917           Young Boys      None  Switzerland           Bern
1918      Young Buffaloes      None    Swaziland        Manzini

In [105]:
df.drop_duplicates(subset=['team', 'country'], inplace=True)

In [106]:
df.team.value_counts()

River Plate        3
Nacional           3
Independiente      2
Everton            2
Rudar              2
                  ..
Fenerbahce         1
Fello Star         1
Feirense           1
FCSB               1
Young Buffaloes    1
Name: team, Length: 1887, dtype: int64

In [107]:
df.reset_index(drop=True, inplace=True)

In [108]:
df

                     team teams_ids      country           city
0                     AaB      None      Denmark        Aalborg
1                Aalesund      None       Norway        Alesund
2                   Aarau      None  Switzerland          Aarau
3                     ABC      None       Brazil          Natal
4                Aberdeen      None     Scotland       Aberdeen
...                   ...       ...          ...            ...
1900             Yokohama      None        Japan       Yokohama
1901  Yokohama F. Marinos      None        Japan       Yokohama
1902       Young Africans      None     Tanzania  Dar-es-Salaam
1903           Young Boys      None  Switzerland           Bern
1904      Young Buffaloes      None    Swaziland        Manzini

[1905 rows x 4 columns]

In [163]:
# with open('pickle_files/df_teams_data_main', 'wb') as f:
#     pickle.dump(df, f)

### Add teams data

In [3]:
# df_teams_data_main
with open('pickle_files/teams_data/df_tmd_main_created_28_06_2022', 'rb') as f:
    df_teams_data_main = pickle.load(f)

In [4]:
print('shape - ', df_teams_data_main.shape[0])
df_teams_data_main.head(3)

shape -  4062

       team team_id      country     city
0       AaB    None      Denmark  Aalborg
1  Aalesund    None       Norway  Alesund
2     Aarau    None  Switzerland    Aarau

In [6]:
with open('pickle_files/teams_data/tmd_26_05_2022/df_after_corr_26_05_2022_third', 'rb') as f:
    df_tmd_26_05_2022 = pickle.load(f)

In [7]:
print('shape - ', df_tmd_26_05_2022.shape[0])
df_tmd_26_05_2022.head(3)

shape -  90

  team_id           team  country           city
0     281  West Bromwich  England  West Bromwich
1   14607          Volos   Greece          Volos
2    8986      Dunkerque   France        Dunkirk

In [8]:
df_teams_data = pd.concat([df_teams_data_main, df_tmd_26_05_2022]).reset_index(drop=True)

In [9]:
print('shape - ', df_teams_data.shape[0])
df_teams_data.head(3)

shape -  4152

       team team_id      country     city
0       AaB    None      Denmark  Aalborg
1  Aalesund    None       Norway  Alesund
2     Aarau    None  Switzerland    Aarau

In [10]:
df_teams_data.team    = df_teams_data.team.str.strip()
df_teams_data.country = df_teams_data.country.str.strip()
df_teams_data.city    = df_teams_data.city.str.strip()

In [11]:
df_teams_data.team.value_counts(dropna=False).head()

River Plate         3
Nacional            3
Shandong Taishan    2
Rudar               2
Al Orubah           2
Name: team, dtype: int64

In [12]:
df_teams_data.country.value_counts(dropna=False).head()

Italy      186
Spain      176
Brazil     174
England    150
Germany    130
Name: country, dtype: int64

In [13]:
df_teams_data.country.value_counts(dropna=False).tail()

South Sudan      1
Liechtenstein    1
Mauritius        1
Malawi           1
Benin            1
Name: country, dtype: int64

In [14]:
df_teams_data.city.value_counts(dropna=False).head()

Buenos Aires    55
Montevideo      30
Cairo           17
London          14
Yerevan         13
Name: city, dtype: int64

In [15]:
df_teams_data = df_teams_data[~df_teams_data.city.isin(['nd'])].copy().reset_index(drop=True)

In [16]:
print('shape - ', df_teams_data.shape[0])
df_teams_data.head(3)

shape -  4152

       team team_id      country     city
0       AaB    None      Denmark  Aalborg
1  Aalesund    None       Norway  Alesund
2     Aarau    None  Switzerland    Aarau

In [17]:
# After csv formating - 'nan'
df_teams_data[df_teams_data.city == 'nan']

Empty DataFrame
Columns: [team, team_id, country, city]
Index: []

In [18]:
dbl_teams_lst = df_teams_data[df_teams_data.duplicated(subset=['team', 'country'])].team

In [19]:
dbl_teams_lst[:3]

4122    Dungannon
Name: team, dtype: object

In [20]:
df_teams_uniq = df_teams_data[~df_teams_data.team.isin(dbl_teams_lst)].copy().reset_index(drop=True)

In [21]:
print('shape - ', df_teams_uniq.shape[0])
df_teams_uniq.head(3)

shape -  4150

       team team_id      country     city
0       AaB    None      Denmark  Aalborg
1  Aalesund    None       Norway  Alesund
2     Aarau    None  Switzerland    Aarau

In [22]:
df_teams_dbl = df_teams_data[df_teams_data.team.isin(dbl_teams_lst)].copy().reset_index(drop=True)

In [23]:
print('shape - ', df_teams_dbl.shape[0])
df_teams_dbl.head(3)

shape -  2

        team team_id           country                  city
0  Dungannon    9703  Northern Ireland             Dungannon
1  Dungannon    9703  Northern Ireland  the NIFL Premiership

In [24]:
df_teams_dbl = df_teams_dbl[~df_teams_dbl.team_id.isna()].copy()
print('shape - ', df_teams_dbl.shape[0])

shape -  2

In [25]:
df_teams_dbl.drop_duplicates(subset=['team', 'country'], inplace=True)
print('shape - ', df_teams_dbl.shape[0])

shape -  1

In [26]:
df_teams_dbl

        team team_id           country       city
0  Dungannon    9703  Northern Ireland  Dungannon

In [27]:
df_tmd_main = pd.concat([df_teams_uniq, df_teams_dbl]).reset_index(drop=True)
print('shape - ', df_tmd_main.shape[0])
df_tmd_main.head(3)

shape -  4151

       team team_id      country     city
0       AaB    None      Denmark  Aalborg
1  Aalesund    None       Norway  Alesund
2     Aarau    None  Switzerland    Aarau

In [ ]:
# Check this names 
# Korea Republic = South Korea, China PR = China, Czech Republic = Czechia, Republic of Ireland = Ireland, FYR Macedonia = North Macedonia
# df.loc[885:885, 'city'] = 'Stuttgart'
# df[df.country == 'Hong Kong'] 
# df.country = df.country.map(lambda x: 'North Macedonia' if x == 'FYR Macedonia' else x)

In [29]:
# file = open('pickle_files/df_tmd_main_created_29_06_2022', 'wb')
# pickle.dump(df_tmd_main, file)  
# file.close()

In [ ]:
# club = 'Vila Nova'
# country = 'Brazil'
# city = 'Goiania'

# new_club = {'club':club, 'club_country':country, 'club_city':city}
# new_club = pd.DataFrame([new_club])
# print(new_club)
# df_for_add = pd.concat([df_for_add, new_club], ignore_index=True)